submission_logs/2_2_two_middlewares/32/32/1-0/2/memtier/4.log
1         Threads
32        Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2376.16          ---          ---     13.46300      9598.37 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2376.16         0.00         0.00     13.46300      9598.37 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.400         0.00
SET       1.500         0.00
SET       1.600         0.01
SET       1.700         0.02
SET       1.800         0.03
SET       1.900         0.04
SET       2.000         0.05
SET       2.100         0.07
SET       2.200         0.09
SET       2.300         0.12
SET       2.400         0.15
SET       2.500         0.21
SET       2.600         0.24
SET       2.700         0.29
SET       2.800         0.35
SET       2.900         0.41
SET       3.000         0.48
SET       3.100         0.54
SET       3.200         0.60
SET       3.300         0.68
SET       3.400         0.76
SET       3.500         0.84
SET       3.600         0.93
SET       3.700         1.03
SET       3.800         1.11
SET       3.900         1.21
SET       4.000         1.31
SET       4.100         1.42
SET       4.200         1.51
SET       4.300         1.61
SET       4.400         1.70
SET       4.500         1.79
SET       4.600         1.89
SET       4.700         1.99
SET       4.800         2.10
SET       4.900         2.20
SET       5.000         2.32
SET       5.100         2.42
SET       5.200         2.51
SET       5.300         2.62
SET       5.400         2.74
SET       5.500         2.85
SET       5.600         2.96
SET       5.700         3.08
SET       5.800         3.20
SET       5.900         3.34
SET       6.000         3.48
SET       6.100         3.64
SET       6.200         3.79
SET       6.300         3.93
SET       6.400         4.08
SET       6.500         4.22
SET       6.600         4.36
SET       6.700         4.50
SET       6.800         4.65
SET       6.900         4.78
SET       7.000         4.90
SET       7.100         5.02
SET       7.200         5.14
SET       7.300         5.26
SET       7.400         5.37
SET       7.500         5.50
SET       7.600         5.60
SET       7.700         5.70
SET       7.800         5.83
SET       7.900         5.96
SET       8.000         6.08
SET       8.100         6.18
SET       8.200         6.30
SET       8.300         6.42
SET       8.400         6.54
SET       8.500         6.66
SET       8.600         6.78
SET       8.700         6.91
SET       8.800         7.04
SET       8.900         7.17
SET       9.000         7.31
SET       9.100         7.45
SET       9.200         7.60
SET       9.300         7.75
SET       9.400         7.90
SET       9.500         8.07
SET       9.600         8.23
SET       9.700         8.41
SET       9.800         8.62
SET       9.900         8.82
SET      10.000        10.64
SET      11.000        20.67
SET      12.000        41.84
SET      13.000        62.55
SET      14.000        74.77
SET      15.000        80.54
SET      16.000        83.26
SET      17.000        84.83
SET      18.000        87.05
SET      19.000        90.87
SET      20.000        94.89
SET      21.000        97.34
SET      22.000        98.56
SET      23.000        99.18
SET      24.000        99.43
SET      25.000        99.54
SET      26.000        99.61
SET      27.000        99.69
SET      28.000        99.77
SET      29.000        99.82
SET      30.000        99.87
SET      31.000        99.90
SET      32.000        99.91
SET      33.000        99.93
SET      34.000        99.94
SET      35.000        99.95
SET      36.000        99.96
SET      37.000        99.96
SET      38.000        99.97
SET      39.000        99.98
SET      40.000        99.98
SET      41.000        99.98
SET      42.000        99.98
SET      43.000        99.98
SET      44.000        99.98
SET      45.000        99.99
SET      52.000        99.99
SET      56.000        99.99
SET      61.000        99.99
SET      63.000        99.99
SET      64.000        99.99
SET      66.000       100.00
SET      70.000       100.00
SET      72.000       100.00
SET      73.000       100.00
SET      74.000       100.00
SET      75.000       100.00
---
---